justcallmekoko/ESP32Marauder/esp32_marauder/WiFiScan.h
    uint8_t association_packet[200] = {
                              0x00, 0x10, // Frame Control (Association Request) PM=1
                              0x3a, 0x01, // Duration
                              0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, // Destination (Broadcast)
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // Source (Fake Source or BSSID)
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // BSSID
                              0x00, 0x00,                         // Sequence Control
                              0x31, 0x00,                         // Capability Information (PM=1)
                              0x0a, 0x00,                         // Listen Interval
                              0x00,                               // SSID tag
                              0x00,                               // SSID length      
                          };

    enum EBLEPayloadType
    {
      Microsoft,
      Apple,
      Samsung,
      Google,
      FlipperZero,
      Airtag
    };

      #ifdef HAS_BT

      struct BLEData
      {
        NimBLEAdvertisementData AdvData;
        NimBLEAdvertisementData ScanData;
      };

      struct WatchModel
      {
          uint8_t value;
          const char *name;
      };

      WatchModel* watch_models = nullptr;

      static void scanCompleteCB(BLEScanResults scanResults);
      NimBLEAdvertisementData GetUniversalAdvertisementData(EBLEPayloadType type);
    #endif

    void updateTrackerUI();
    void showNetworkInfo();
    void setNetworkInfo();
    void fullARP();
    bool readARP(IPAddress targ_ip);
    bool singleARP(IPAddress ip_addr);
    void pingScan(uint8_t scan_mode = WIFI_PING_SCAN);
    void portScan(uint8_t scan_mode = WIFI_PORT_SCAN_ALL, uint16_t targ_port = 22);
    bool isHostAlive(IPAddress ip);
    bool checkHostPort(IPAddress ip, uint16_t port, uint16_t timeout = 100);
    String extractManufacturer(const uint8_t* payload);
    int checkMatchAP(char addr[], bool update_ap = true);
    bool beaconHasWPS(const uint8_t* payload, int len);
    uint8_t getSecurityType(const uint8_t* beacon, uint16_t len);
    void addAnalyzerValue(int16_t value, int rssi_avg, int16_t target_array[], int array_size);
    bool mac_cmp(struct mac_addr addr1, struct mac_addr addr2);
    bool mac_cmp(uint8_t addr1[6], uint8_t addr2[6]);
    void clearMacHistory();
    void executeWarDrive();
    void executeSourApple();
    void executeSpoofAirtag();
    void executeSwiftpairSpam(EBLEPayloadType type);
    void startWardriverWiFi();
    void saeAttackLoop(uint32_t currentTime);
    //void generateRandomMac(uint8_t* mac);
    //void generateRandomName(char *name, size_t length);
    String processPwnagotchiBeacon(const uint8_t* frame, int length);

    void startWiFiAttacks(uint8_t scan_mode, uint16_t color, String title_string);

    void signalAnalyzerLoop(uint32_t tick);
    void channelAnalyzerLoop(uint32_t tick);
    void channelActivityLoop(uint32_t tick);
    void packetRateLoop(uint32_t tick);
    void packetMonitorMain(uint32_t currentTime);
    void eapolMonitorMain(uint32_t currentTime);
    void updateMidway();
    void tftDrawXScalButtons();
    void tftDrawYScaleButtons();
    void tftDrawChannelScaleButtons();
    void tftDrawColorKey();
    void tftDrawGraphObjects();
    bool sendSAECommitFrame(uint8_t* targ_addr, uint8_t* src_addr) ;
    void sendProbeAttack(uint32_t currentTime);
    void sendDeauthAttack(uint32_t currentTime, String dst_mac_str = "ff:ff:ff:ff:ff:ff");
    void sendBadMsgAttack(uint32_t currentTime, bool all = false);
    void sendAssocSleepAttack(uint32_t currentTime, bool all = false);
    void sendDeauthFrame(uint8_t bssid[6], int channel, String dst_mac_str = "ff:ff:ff:ff:ff:ff");
    void sendDeauthFrame(uint8_t bssid[6], int channel, uint8_t mac[6]);
    void sendEapolBagMsg1(uint8_t bssid[6], int channel, String dst_mac_str = "ff:ff:ff:ff:ff:ff", uint8_t sec = WIFI_SECURITY_WPA2);
    void sendEapolBagMsg1(uint8_t bssid[6], int channel, uint8_t mac[6], uint8_t sec = WIFI_SECURITY_WPA2);
    void sendAssociationSleep(const char* ESSID, uint8_t bssid[6], int channel, uint8_t mac[6]);
    void sendAssociationSleep(const char* ESSID, uint8_t bssid[6], int channel, String dst_mac_str = "ff:ff:ff:ff:ff:ff");
    void broadcastRandomSSID(uint32_t currentTime);
    void broadcastCustomBeacon(uint32_t current_time, ssid custom_ssid);
    void broadcastCustomBeacon(uint32_t current_time, AccessPoint custom_ssid);
    void broadcastSetSSID(uint32_t current_time, const char* ESSID);
    void RunAPScan(uint8_t scan_mode, uint16_t color);
    void RunGPSNmea();
    void RunMimicFlood(uint8_t scan_mode, uint16_t color);
    void RunPwnScan(uint8_t scan_mode, uint16_t color);
    void RunPineScan(uint8_t scan_mode, uint16_t color);
    void RunMultiSSIDScan(uint8_t scan_mode, uint16_t color);
    void RunBeaconScan(uint8_t scan_mode, uint16_t color);
    void RunRawScan(uint8_t scan_mode, uint16_t color);
    void RunStationScan(uint8_t scan_mode, uint16_t color);
    void RunDeauthScan(uint8_t scan_mode, uint16_t color);
    void RunEapolScan(uint8_t scan_mode, uint16_t color);
    void RunProbeScan(uint8_t scan_mode, uint16_t color);
    void RunSAEScan(uint8_t scan_mode, uint16_t color);
    void RunPacketMonitor(uint8_t scan_mode, uint16_t color);
    void RunBluetoothScan(uint8_t scan_mode, uint16_t color);
    void RunSourApple(uint8_t scan_mode, uint16_t color);
    void RunSwiftpairSpam(uint8_t scan_mode, uint16_t color);
    void RunEvilPortal(uint8_t scan_mode, uint16_t color);
    void RunPingScan(uint8_t scan_mode, uint16_t color);
    void RunPortScanAll(uint8_t scan_mode, uint16_t color);
    bool checkMem();
    void parseBSSID(const char* bssidStr, uint8_t* bssid);
    void writeHeader(bool poi = false);
    void writeFooter(bool poi = false);
    void displayWardriveStats();


  public:
    WiFiScan();

    //AccessPoint ap_list;

    //LinkedList<ssid>* ssids;

    volatile bool bt_cb_busy = false;
    volatile bool bt_pending_clear = false;

