justcallmekoko/ESP32Marauder/esp32_marauder/WiFiScan.h
    bool send_deauth = false;


    static MacEntry mac_entries[mac_history_len_half];
    static uint8_t mac_entry_state[mac_history_len_half];

    uint8_t dual_band_channels[DUAL_BAND_CHANNELS] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 32, 36, 40, 44, 48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 144, 149, 153, 157, 161, 165, 169, 173, 177};

    uint8_t dual_band_channel_index = 0;

    // Stuff for RAW stats
    uint32_t mgmt_frames = 0;
    uint32_t data_frames = 0;
    uint32_t beacon_frames = 0;
    uint32_t req_frames = 0;
    uint32_t resp_frames = 0;
    uint32_t deauth_frames = 0;
    uint32_t eapol_frames = 0;
    uint32_t complete_eapol = 0;
    int8_t min_rssi = 0;
    int8_t max_rssi = -128;

    int bt_frames = 0;

    bool force_pmkid = false;
    bool force_probe = false;
    bool save_pcap = false;
    bool ep_deauth = false;
    bool ble_scanning = false;

    char* flock_ssid[4] = {
      "flock",
      "penguin",
      "pigvision",
      "fs ext battery"
    };

    #ifdef HAS_DUAL_BAND
      uint8_t channel_activity[DUAL_BAND_CHANNELS] = {};
    #else
      uint8_t channel_activity[MAX_CHANNEL] = {};
    #endif

    uint8_t activity_page = 1;

    String analyzer_name_string = "";
    
    uint8_t analyzer_frames_recvd = 0;

    bool analyzer_name_update = false;

    uint8_t set_channel = 1;

    uint8_t old_channel = 0;

    int16_t _analyzer_value = 0;

    bool orient_display = false;
    bool wifi_initialized = false;
    bool ble_initialized = false;
    bool wifi_connected = false;

    String free_ram = "";
    String old_free_ram = "";
    String connected_network = "";

    IPAddress ip_addr;
    IPAddress gateway;
    IPAddress subnet;

    IPAddress current_scan_ip;

    uint16_t current_scan_port = 1;

    String dst_mac = "ff:ff:ff:ff:ff:ff";
    byte src_mac[6] = {};

    #ifdef HAS_SCREEN
      int16_t _analyzer_values[TFT_WIDTH];
      int16_t _temp_analyzer_values[TFT_WIDTH];
    #endif

    String current_mini_kb_ssid = "";

    const String alfa = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ 0123456789-=[];',./`\\_+{}:\"<>?~|!@#$%^&*()";

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();

    #ifndef HAS_IDF_3
      wifi_init_config_t cfg2 = { \
          .event_handler = &esp_event_send_internal, \
          .osi_funcs = &g_wifi_osi_funcs, \
          .wpa_crypto_funcs = g_wifi_default_wpa_crypto_funcs, \
          .static_rx_buf_num = 6,\
          .dynamic_rx_buf_num = 6,\
          .tx_buf_type = 0,\
          .static_tx_buf_num = 1,\
          .dynamic_tx_buf_num = WIFI_DYNAMIC_TX_BUFFER_NUM,\
          .cache_tx_buf_num = 0,\
          .csi_enable = false,\
          .ampdu_rx_enable = false,\
          .ampdu_tx_enable = false,\
          .amsdu_tx_enable = false,\
          .nvs_enable = false,\
          .nano_enable = WIFI_NANO_FORMAT_ENABLED,\
          .rx_ba_win = 6,\
          .wifi_task_core_id = WIFI_TASK_CORE_ID,\
          .beacon_max_len = 752, \
          .mgmt_sbuf_num = 8, \
          .feature_caps = g_wifi_feature_caps, \
          .sta_disconnected_pm = WIFI_STA_DISCONNECTED_PM_ENABLED,  \
          .espnow_max_encrypt_num = 0, \
          .magic = WIFI_INIT_CONFIG_MAGIC\
      };
    #else
      wifi_country_t country = {
        .cc = "PH",
        .schan = 1,
        .nchan = 13,
        .policy = WIFI_COUNTRY_POLICY_AUTO,
      };

      wifi_init_config_t cfg2 = WIFI_INIT_CONFIG_DEFAULT();
    #endif

    wifi_config_t ap_config;

    uint32_t getCompleteEapol(int check_index = -1);
    void drawChannelLine();
    #ifdef HAS_SCREEN
      int8_t checkAnalyzerButtons(uint32_t currentTime);
    #endif
    bool seen_mac(unsigned char* mac, bool simple = true);
    int16_t seen_mac_int(unsigned char* mac, bool simple = true);
    int update_mac_entry(const uint8_t mac[6], int8_t rssi = 0, bool bt = false);
    inline void insert_mac_entry(uint32_t idx, const uint8_t mac[6], uint32_t now_ms, int8_t rssi = 0, bool bt = false);
    void evict_and_insert(const uint8_t mac[6], uint32_t now_ms);
    uint8_t build_top10_for_ui(MacEntry* out_top10, MacSortMode mode);
    void save_mac(unsigned char* mac);
    #ifdef HAS_BT
      void copyNimbleMac(const BLEAddress &addr, unsigned char out[6]);
    #endif
    bool filterActive();
    bool RunGPSInfo(bool tracker = false, bool display = true, bool poi = false);
    void logPoint(String lat, String lon, float alt, String datetime, bool poi = false);
    void setMac();
    void renderRawStats();
    void renderPacketRate();
    void displayAnalyzerString(String str);
    String security_int_to_string(int security_type);
    char* stringToChar(String string);
    void RunSetup();
    int clearSSIDs();
    int clearAPs();
    int clearIPs();
    int clearAirtags();
    int clearFlippers();
    int clearStations();
    int clearPineScanTrackers();
    int clearMultiSSID();
    bool addSSID(String essid);
    int generateSSIDs(int count = 20);
    bool shutdownWiFi();
    bool shutdownBLE();
    bool scanning();
    bool joinWiFi(String ssid, String password, bool gui = true);
    bool startWiFi(String ssid, String password, bool gui = true);
    void getMAC(bool get_sta, uint8_t* mac);
    String freeRAM();
    void changeChannel();
    void changeChannel(int chan);
    void RunAPInfo(uint16_t index, bool do_display = true);
    void RunInfo();
    //void RunShutdownBLE();
    void RunSetMac(uint8_t * mac, bool ap = true);
    void RunGenerateRandomMac(bool ap = true);
    void RunGenerateSSIDs(int count = 20);
    void RunClearSSIDs();
    void RunClearAPs();
    void RunClearStations();
    void RunSaveSSIDList(bool save_as = true);
    void RunLoadSSIDList();
    void RunSaveAPList(bool save_as = true);
    void RunLoadAPList();
    void RunSaveATList(bool save_as = true);
    void RunLoadATList();
    void RunSetupGPSTracker(uint8_t scan_mode);
    void channelHop(bool filtered = false, bool ranged = false);
    uint8_t currentScanMode = 0;
    void main(uint32_t currentTime);
    void StartScan(uint8_t scan_mode, uint16_t color = 0);
    void StopScan(uint8_t scan_mode);
    void setBaseMacAddress(uint8_t macAddr[6]);
    //const char* generateRandomName();

    bool save_serial = false;
    void startPcap(String file_name);
    void startLog(String file_name);
    void startGPX(String file_name);
    //String macToString(const Station& station);

    static bool initMbedtls();
    static int mbedtls_entropy_source(void *data, unsigned char *output, size_t len);
    static bool getSAEACT(const uint8_t *frame, size_t frame_len, uint16_t &group_out, size_t &act_len_out);
    static bool sae_group_sizes(uint16_t group, size_t &scalar_len, size_t &element_len);
    static bool mac_cmp(const uint8_t *a, const uint8_t *b);
    static inline uint16_t le16(const uint8_t *p);
    static void getMAC(char *addr, uint8_t* data, uint16_t offset);
    static void getMAC(uint8_t* mac, const uint8_t* data, uint16_t offset);
    static void pwnSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void beaconSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    //static void rawSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void stationSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void apSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void apSnifferCallbackFull(void* buf, wifi_promiscuous_pkt_type_t type);
    static void deauthSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    //static void probeSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void beaconListSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void activeEapolSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void eapolSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void wifiSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void pineScanSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type); // Pineapple
    static int extractPineScanChannel(const uint8_t* payload, int len); // Pineapple
    static void multiSSIDSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type); // MultiSSID
    static inline uint32_t hash_mac(const uint8_t mac[6]);
};
#endif
